name: "KSparseAutoencoder_fungus"
layer {
  name: "data"
  type: "Data"
  top: "data"
  include {
    phase: TRAIN
  }
  transform_param {
    scale:0.001
    mean_file: "/Users/tianchuliang/Documents/GT_Acad/CSE6240Spring16/tliang37-project2/data/Fungus/Train/fungus_train.binaryproto"
  }
  data_param {
    source: "/Users/tianchuliang/Documents/GT_Acad/CSE6240Spring16/tliang37-project2/data/Fungus/Train/fungus_train_lmdb"
    batch_size: 1
    backend: LMDB
  }
}
layer {
  name: "data"
  type: "Data"
  top: "data"
  include {
    phase: TEST
  }
  transform_param {
    scale:0.001
    mean_file: "/Users/tianchuliang/Documents/GT_Acad/CSE6240Spring16/tliang37-project2/data/Fungus/Test/fungus_test.binaryproto"
  }
  data_param {
    source: "/Users/tianchuliang/Documents/GT_Acad/CSE6240Spring16/tliang37-project2/data/Fungus/Test/fungus_test_lmdb"
    batch_size: 1
    backend: LMDB
  }
}
layer {
  name: "flatdata"
  type: "Flatten"
  bottom: "data"
  top: "flatdata"
}
layer {
  name: "encode1"
  type: "InnerProduct"
  bottom: "data"
  top: "encode1"
  param {
    lr_mult: 20
    decay_mult: 1
  }
  param {
    lr_mult: 20
    decay_mult: 0
  }
  inner_product_param {
    num_output: 2000
    weight_filler {
      type: "gaussian"
      std: 1
      sparse: 15
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "encode1neuron"
  type: "Sigmoid"
  bottom: "encode1"
  top: "encode1neuron"
}
layer {
  name: "decode1"
  type: "InnerProduct"
  bottom: "encode1neuron"
  top: "decode1"
  param {
    lr_mult: 20
    decay_mult: 1
  }
  param {
    lr_mult: 20
    decay_mult: 0
  }
  inner_product_param {
    num_output: 16384
    weight_filler {
      type: "gaussian"
      std: 1
      sparse: 15
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "decode1neuron"
  type: "Sigmoid"
  bottom: "decode1"
  top: "decode1neuron"
}
layer {
  name: "loss"
  type: "EuclideanLoss"
  bottom: "decode1neuron"
  bottom: "flatdata"
  top: "l2_error"
  loss_weight: 1
}